"""
========================================
-----> intro. to GUI with Tkinter <-----
========================================
"""

from tkinter import *

# ازاي تبدأ الواجهه
App = Tk()

# التحكم في ابعاد الواجهه
App.geometry('400x500+500+200')

# منع او السماح للمستخدم بالتحكم في ابعاد الواجهه
App.resizable(True, True)

# تغيير عنوان البرنامج
App.title('Aladdin')

# تغيير لون خلفية واجهة البرنامج
App.config(background='#8ab2f1')

# تغير ايقونة البرنامج
# (يجب ان تكون الصورة محفوظه علي جهازك و ان تكون ب امتداد .ico)
App.iconbitmap(r'D:\Python\files\twitter.ico')

# اقصى حد يمكن تصغير البرنامج اليه
App.minsize(300,400)

# اقصى حد يمكن تكبير البرنامج اليه
App.maxsize(600, 700)

# انشاء قسم في واجهة البرنامج
f = Frame(App, width=300, height=80, bg='silver')
# اضافة ذلك القسم الى البرنامج
f.pack()

# اهم سطر وهو المسؤول عن اظهار البرنامج وتفعيله
App.mainloop()
